<template>
  <div>
    <el-input v-model="id" placeholder="请输入ID"></el-input>
    <el-button type="primary" @click="loadHealthProfile">加载健康画像</el-button>
    <!-- 功能点：个人健康画像展示 -->
    <el-card v-if="healthProfile" class="health-profile-card">
      <h2>ID: {{ id }}</h2>
      <div v-for="(record, index) in healthProfile" :key="index" class="record-item">
        <h3>就诊名称 {{ index + 1 }}:</h3>

        <p>{{ record.sub_content[0].zzdmc }}</p>
        <p>{{ record.sub_content[0].zdmc1 }}</p>
        <p>{{ record.sub_content[0].zdmc2 }}</p>
        <p>{{ record.sub_content[0].zdmc3 }}</p>
        <p>{{ record.sub_content[0].zdmc4 }}</p>

      </div>
      <div id="healthProfileChart" style="width: 600px;height:400px;"></div>
    </el-card>
  </div>
</template>

<script>
import { ref } from 'vue';
import axios from 'axios';
import { JZMC_URL } from '@/api/api.js'; // 导入 URL

export default {
  setup() {
    const id = ref('');
    const healthProfile = ref(null);

    async function loadHealthProfile() {
      healthProfile.value = await fetchHealthData(id.value);
      if (!healthProfile.value) {
        alert('未找到对应的健康记录。');
      }
    }

    async function fetchHealthData(personId) {
      try {
        const response = await axios.get(JZMC_URL);
        const data = response.data;
        // const data=[
        //   {
        //     "id": "1001Z810000002TIRMOD",
        //     "sub_content": [
        //       {
        //         "check_name": "彩色多普勒心脏+组织多普勒显像+室壁运动分析",
        //         "content": "测值：\n右室内径:23mm(20-25)   右室流出道:29mm(19-35) 左房前后径:31mm(19-35)\n主动脉根部:27mm(20-37) 升主动脉径:30mm (&lt38)  室间隔厚度:10mm(6-11) \n左室后壁厚度:10mm(6-11)左室舒张末径:42mm(35-56) 左室射血分数:59%    \n肺动脉径:24mm(16-24)\n多普勒超声：   \nMV：E峰:110cm/s，A峰:142cm/s ；TV:58cm/s； AV:84cm/s；PV:61cm/s；\n超声所见：\n　　各房室腔内径正常范围，室间隔及左、右室壁厚度正常，运动协调，收缩幅度正常。各瓣膜形态、结构、运动未见明显异常。大动脉关系、内径正常。心包腔未见异常。\n多普勒检查：\n各瓣膜口未探及明显反流。   \n组织多普勒（TDI）：心尖四腔切面\n二尖瓣环舒张期运动速度：间隔侧 E’:7cm/s；A’:12 cm/s\n                        侧壁侧 E’:8cm/s；A’: 14cm/s\n室壁运动分析：左室壁各节段运动未见明显异常",
        //         "text": "静息状态下室壁运动未见明显异常",
        //         "time": "2022/3/28 14:02",
        //         "name": "心"
        //       },
        //       {
        //         "check_name": "彩超腹部（含肝、胆、脾  胰）",
        //         "content": "右肾内可见多个大者约1.5*1.4cm无回声团，边清壁薄，未见血流信号，部分壁上可见强回声。\n左肾大小、形态正常，结构清晰，皮髓质分界清晰，内肾盏内可见数个大者约0.5*0.4cm强回声团，后伴声影。左肾内可见多个大者约2.2*1.8cm无回声团，边清壁薄，未见血流信号，部分壁上可见强回声。\n双输尿管未见扩张。\n膀胱充盈欠佳，内似未见明显异常回声\n前列腺体积增大，大小约3.3*4.5*3.1cm，内部回声不均匀，其内可见强回声团。\n肝脏：肝脏大小形态正常，肝回声增强、细密，远场回声轻度衰减，血管纹理显示欠清晰，左叶及右叶实质内可见多个无回声区，大者约0.7*0.6 cm，边清壁薄，后方回声增强，内未见明显血流信号。\n胆囊：大小、形态正常，内透声好，壁不厚，腔内未见明显异常团块。\n肝内外胆管不扩张。\n脾脏：大小正常，实质回声细小均匀。\n胰腺：内回声均匀。",
        //         "text": "1.左肾结石；双肾囊肿并部分囊壁钙化\n2.肝囊肿；脂肪肝\n3.前列腺增生并钙化",
        //         "time": "2022/3/29 7:57",
        //         "name": "肝胆"
        //       },
        //       {
        //         "check_name": "彩超泌尿系(含双肾、输尿管、膀胱、前列腺)(增)(女性除外)",
        //         "content": "右肾内可见多个大者约1.5*1.4cm无回声团，边清壁薄，未见血流信号，部分壁上可见强回声。\n左肾大小、形态正常，结构清晰，皮髓质分界清晰，内肾盏内可见数个大者约0.5*0.4cm强回声团，后伴声影。左肾内可见多个大者约2.2*1.8cm无回声团，边清壁薄，未见血流信号，部分壁上可见强回声。\n双输尿管未见扩张。\n膀胱充盈欠佳，内似未见明显异常回声\n前列腺体积增大，大小约3.3*4.5*3.1cm，内部回声不均匀，其内可见强回声团。\n肝脏：肝脏大小形态正常，肝回声增强、细密，远场回声轻度衰减，血管纹理显示欠清晰，左叶及右叶实质内可见多个无回声区，大者约0.7*0.6 cm，边清壁薄，后方回声增强，内未见明显血流信号。\n胆囊：大小、形态正常，内透声好，壁不厚，腔内未见明显异常团块。\n肝内外胆管不扩张。\n脾脏：大小正常，实质回声细小均匀。\n胰腺：内回声均匀。",
        //         "text": "1.左肾结石；双肾囊肿并部分囊壁钙化\n2.肝囊肿；脂肪肝\n3.前列腺增生并钙化",
        //         "time": "2022/3/29 7:57",
        //         "name": "肾"
        //       },
        //       {
        //         "check_name": "多层螺旋CT头颈部大血管(CTA)",
        //         "content": "CTA轴位、MPR、MIP及VRT显示：主动脉弓部分显示，其上三支大血管分支（头臂干、左颈总动脉、左锁骨下动脉）显示清晰，双侧锁骨下动脉、头臂干及左侧颈总动脉管壁可见钙化斑，左侧颈总动脉近段管腔内另见附壁低密度影，管腔中度狭窄。双侧颈内动脉虹吸部管壁可见多发钙化致密影，管腔轻中度狭窄。左侧大脑后动脉P2段局部明显狭窄，远端血管显示可。双侧大脑中动脉、后及前动脉管壁走行僵硬、略粗细不均。右侧椎动脉全程纤细，其V3段远端及V4段近端管腔明显狭窄并显影浅淡。左侧椎动脉起自于主动弓，起始处管壁见局限性小钙化灶。余头颈部各主要血管显影清晰，未见明显狭窄及局限性突起影，各血管走行位置未见明显异常。所示左侧基底节区可见结节样低密度影，右侧侧脑室体部旁及基底节区可见斑片样稍低密度灶。",
        //         "text": "1、双侧锁骨下动脉、头臂干及左侧颈总动脉管壁钙化斑，管腔轻度狭窄；左侧颈总动脉近段非钙化斑，管腔中度狭窄；双侧颈内动脉虹吸部管壁多发钙化斑，管腔轻中度狭窄。\n2、左侧大脑后动脉P2段局部明显狭窄。\n3、右侧椎动脉全程纤细，其V3段远端及V4段近端管腔明显狭窄。\n4、左侧椎动脉异位起源并起始处局限性钙化灶。\n5、左侧基底节区陈旧性病灶；拟右侧侧脑室体部旁及基底节区缺血灶。",
        //         "time": "2022/3/28 15:00",
        //         "name": "脑"
        //       }
        //     ]
        //   },
        //   {
        //     "id": "1001Z810000002RGDVR7",
        //     "sub_content": [
        //       {
        //         "check_name": "彩色多普勒心脏+组织多普勒显像+室壁运动分析",
        //         "content": "测值：\n右室内径:23mm(20-25)   右室流出道:32mm(19-35) 左房前后径:28mm(19-35)\n主动脉根部:24mm(20-37) 升主动脉径:36mm (&lt38)  室间隔厚度:9mm(6-11) \n左室后壁厚度:9mm(6-11)左室舒张末径:42mm(35-56) 左室射血分数:60%    \n肺动脉径:21mm(16-24)\n多普勒超声：   \nMV：E峰:72cm/s，A峰:80cm/s ；TV:74cm/s； AV:115cm/s；PV:86cm/s；\n超声所见：\n　　各房室腔内径正常范围，室间隔及左、右室壁厚度正常，运动协调，收缩幅度正常。各瓣膜形态、结构、运动未见明显异常。大动脉关系、内径正常。心包腔未见异常。\n多普勒检查：\n各瓣膜口未探及明显反流。   \n组织多普勒（TDI）：心尖四腔切面\n二尖瓣环舒张期运动速度：间隔侧 E’:8cm/s；A’: 10cm/s\n                        侧壁侧 E’:9cm/s；A’: 12cm/s\n室壁运动分析：左室壁各节段运动未见明显异常",
        //         "text": "静息状态下：\n心内结构、血流及运动未见明显异常",
        //         "time": "2022/3/16 10:25",
        //         "name": "心"
        //       },
        //       {
        //         "check_name": "多层螺旋CT胸部(增强)",
        //         "content": "胸廓显示对称，气管居中，左肺上叶尖后段见一软组织肿块影，大小约3.8*3.9cm，呈分叶状，周围可见毛刺，邻近胸膜可见牵拉，局部见支气管包绕阻塞，增强后呈轻度延迟强化。另左侧胸膜下及肺内见多个结节影，大者位于左肺下叶背段，约1.8*1.5cm，呈轻度强化，左肺下舌段、左下肺及右肺中叶内侧段可见少许条索状影，边界清晰，纵隔内见数个稍肿大淋巴结影，呈明显强化，心影不大，主动脉弓缩窄，局部周围见新月形未强化灶，局部见小结节突起样强化灶，左侧胸腔内见积液密度影。右侧第7肋骨内见小片状高密度影。左侧第6.7肋骨可见骨质破坏。",
        //         "text": "1.左肺上叶占位，左侧胸膜下及肺内多发结节影，考虑左肺上叶周围型肺Ca并左肺、胸膜转移，请结合临床。\n2.左肺下舌段及右肺中叶内侧段少许慢性感染灶，请结合临床。\n3.左侧胸腔积液，部分为包裹性积液。\n4.左侧第6.7肋骨骨质破坏，拟为转移，请结合骨扫描。\n5.右侧第7肋骨内高密度影，骨岛？请结合临床。\n6.主动脉粥样硬化形成，主动脉弓穿通性溃疡。",
        //         "time": "2022/3/16 17:27",
        //         "name": "肺"
        //       },
        //       {
        //         "check_name": "磁共振扫描颅脑(平扫)",
        //         "content": "双侧侧脑室前后角旁及半卵圆中心区可见少许斑片状稍长T2信号影。余脑实质未见明显异常信号影，脑室系统未见明显扩大，脑沟脑裂未见加深，中线结构居中。",
        //         "text": "轻度缺血脱髓鞘脑改变。",
        //         "time": "2022/3/22 12:14",
        //         "name": "脑"
        //       },
        //       {
        //         "check_name": "彩超胸部（含肺、胸腔、纵隔）",
        //         "content": "检查所见:胸腔坐位经背侧探查：\n左侧胸腔第7-10肋间均可见无回声区,最大前后径约3.2厘米。\n右侧胸腔未见明显无回声区。",
        //         "text": "检查提示:1.左侧胸腔积液，建议完善血常规、凝血功能检查后行超声引导下穿刺\n2.右侧胸腔未见明显积液",
        //         "time": "2022/3/25 10:49",
        //         "name": "肺"
        //       },
        //       {
        //         "check_name": "全腹部(上中下腹)(平扫)",
        //         "content": "肝脏大小形态正常，肝实质内未见异常密度影，肝内胆管未见扩张；胆囊不大，囊腔内未见异常密度影。胰腺、脾脏及双肾未见异常。膀胱充盈良好，壁未见增厚，腔内未见异常密度影；前列腺见少许高密度影。双侧精囊腺显示未见异常。腹盆腔内肠管显示未见异常征象，腹膜后未见肿大淋巴结，腹盆腔内未见积液。所示左下肺见软组织结节，直径约1.1cm，左侧胸腔积液影。左侧第6.7肋骨骨质破坏。",
        //         "text": "1、前列腺钙化，余全腹部CT未见明显异常。\n2、所示左下肺结节，左侧胸腔积液。请结合胸部CT检查。\n3、所示左侧第6.7肋骨骨质破坏，拟为转移，请结合骨扫描。",
        //         "time": "2022/3/21 15:20",
        //         "name": "血管"
        //       },
        //       {
        //         "check_name": "全身显像(全身骨平面显像)",
        //         "content": "静脉注射示踪剂Tc-99m-MDP，2-4h后行全身前位及后位骨静态平面显像。\n 全身骨显影清晰，左侧肩胛骨、左侧第6-7前肋及双侧膝关节见异常显像剂分布浓聚影，余骨显像剂分布基本均匀、对称。",
        //         "text": "1.左侧肩胛骨及左侧第6-7前肋骨代谢异常活跃，考虑骨转移改变，请结合相关检查及随诊复查。\n2.双侧膝关节退行性改变。",
        //         "time": "2022/3/23 14:29",
        //         "name": "腿"
        //       },
        //       {
        //         "check_name": "临床操作的彩色多普勒超声引导(半小时)",
        //         "content": "患者左侧胸腔可见液性暗区。\n介入操作经过：\n患者坐位，超声定位点消毒、铺巾，2%利多卡因经皮局部润麻醉，超声引导下进18G穿刺针，避开穿刺路径重要脏器，达左侧胸腔液性暗区内，回抽出淡红色液体，遂放置导丝，退出穿刺针，扩皮器扩皮，放置CVC2，进管深度11cm，退出导丝，引流出淡红色液体，引流遁畅，接肝素帽，固定引流管，局部消毒包扎。患者未诉不适。",
        //         "text": "超声引导下左侧胸腔积液穿刺置管引流术",
        //         "time": "2022/3/25 10:42",
        //         "name": "血管"
        //       },
        //       {
        //         "check_name": "临床CT引导(多层每部位/含扫描)(半小时)(呼吸)",
        //         "content": "患者影像学检查提示左肺上叶尖后段见一软组织肿块影，大小约3.8*3.9cm，呈分叶状，周围可见毛刺，邻近胸膜可见牵拉，局部见支气管包绕阻塞，增强后呈轻度延迟强化。为进一步明确诊断，行CT引导下经皮穿刺活检术。\n患者取平卧位，“金属栅”体表定位标记穿刺点，常规消毒铺巾，2%利多卡因局部浸润麻醉，穿刺17G同轴套管针，即刻扫描调整进针角度及深度6.5cm，直至穿刺于肿物边缘，拔出针芯，接入18G穿刺活检针，连续激发向前切割活检取得灰白色组织3条，复扫见少量出血。穿刺部位消毒和无菌辅料包扎，整个过程患者未诉不适，穿刺完毕，病人安返病房。",
        //         "text": "穿刺活检顺利，取材完成，建议24小时复查胸部DR。",
        //         "time": "2022/3/17 19:12",
        //         "name": "肺"
        //       }
        //     ]
        //   },
        //   {
        //     "id": "1001Z810000002MCJPFM",
        //     "sub_content": [
        //       {
        //         "check_name": "彩色多普勒心脏+组织多普勒显像+室壁运动分析",
        //         "content": "测值：\n右室内径:21mm(20-25)   右室流出道:27mm(19-35) 左房前后径:33mm(19-35)\n主动脉根部:23mm(20-37) 升主动脉径:34mm (&lt38)  室间隔厚度:11mm(6-11) \n左室后壁厚度:10mm(6-11)左室舒张末径:46mm(35-56) 左室射血分数:65%    \n肺动脉径:19mm(16-24)\n多普勒超声：   检查过程中心率较快\nMV：E峰:141cm/s，A峰:121cm/s ；TV:85cm/s； AV:222cm/s；PV:131cm/s；\n超声所见：\n　　各房室腔内径正常范围，室间隔及左、右室壁厚度正常，运动协调，收缩幅度正常。各瓣膜形态、结构、运动未见明显异常。大动脉关系、内径正常。心包腔未见异常。\n多普勒检查：\n各瓣膜口未探及明显反流。   \n组织多普勒（TDI）：心尖四腔切面\n二尖瓣环舒张期运动速度：间隔侧 E’:11cm/s；A’: 14cm/s\n                        侧壁侧 E’:12cm/s；A’:15 cm/s\n室壁运动分析：左室壁各节段运动未见明显异常",
        //         "text": "静息状态下室壁运动未见明显异常",
        //         "time": "2022/2/24 15:35",
        //         "name": "心"
        //       },
        //       {
        //         "check_name": "彩超腹部（含肝、胆、脾  胰）",
        //         "content": "检查所见:肝脏：肝脏实质回声均匀，管道结构显示清晰。肝内似未见明显异常回声。\n胆囊：餐后胆囊，壁毛糙。\n肝内外胆管未见明显扩张。\n脾脏：大小正常，实质回声细小均匀。\n胰腺：因气体干扰，显示不清。\n双肾大小、形态正常，包膜光滑，结构清晰，皮髓质分界清晰，肾窦未见扩张。\n双输尿管未见扩张。\n膀胱未充盈。\n前列腺显示不清。\nCDFI:血流未见明显异常。",
        //         "text": "检查提示:肝脏、脾脏、双肾似未见明显异常。",
        //         "time": "2022/2/24 21:19",
        //         "name": "肝胆"
        //       },
        //       {
        //         "check_name": "全腹部(上中下腹)(平扫)",
        //         "content": "左侧枕叶可见斑片状低密度影；余脑实质内未见明显异常密度影，脑沟裂池增宽、加深，脑室系统扩大，中线结构居中。颅骨未见明显骨折征象。左侧额部及颜面部软组织稍肿胀，额部软组织内可见结节状致密影。\n    患者配合度欠佳，呼吸伪影较重，双侧多根肋骨呈双边影，右侧第1肋局部骨皮质毛糙，密度增高。右侧2-6肋骨骨折，断端移位。右侧第7肋、左侧第3肋局部骨皮质稍褶皱。左第4、5、6、10肋骨皮质不连续，部分断端稍移位。胸骨呈多边影。双侧胸腔内可见积液密度影，右肺上叶及双肺下叶部分膨胀不全。气管及上消化道内可见置管。\n    肝脏大小形态正常，肝右叶边缘可见结节状高密度影；余肝实质内未见异常密度影，肝内外胆管未见扩张；胆囊不大，囊腔内未见异常密度影。胰腺、脾脏及左肾未见异常。右肾内可见类圆形稍高密度影，大小约1.2×1.0cm。左侧肾上腺可见结节状稍低密度影，大小约1.1×1.6cm。膀胱充盈良好，壁未见增厚，腔内可见导尿管影及气体密度影；前列腺内可见结节状高密度影。精囊腺未见明显异常。腹盆腔内肠管显示未见异常征象，腹膜后未见肿大淋巴结，腹盆腔内未见积液。左侧髂外静脉内可见置管。",
        //         "text": "患者配合度欠佳，呼吸伪影较重，所示：\n双侧多根肋骨呈双边影，胸骨呈多边影，建议病情稳定后复查。\n右侧2-6肋、左第4、5、6、10肋骨骨折，部分断端移位。\n右侧第7肋、左侧第3肋局部骨皮质稍褶皱，建议随诊。\n右侧第1肋局部骨皮质毛糙，密度增高，偏陈旧性骨折可能，请结合临床病史。\n双侧胸腔积液；右肺上叶及双肺下叶部分膨胀不全，部分合并肺挫裂伤，随诊。\n左侧额部及颜面部软组织稍肿胀；左额部软组织结节状致密影，考虑异物，请结合临床。\n老年脑；左侧枕叶陈旧灶。\n左侧肾上腺结节，腺瘤可能，必要时增强。\n肝右叶钙化灶，右肾高密度囊肿；前列腺钙化。",
        //         "time": "2022/3/3 13:53",
        //         "name": "血管"
        //       },
        //       {
        //         "check_name": "右胫腓骨正侧位片(DR)",
        //         "content": "急诊报告：\n右侧股骨远端、右胫骨中段及右腓骨中下段粉碎性骨折并右股骨及右胫骨内固定中，局部周围软组织肿胀并积气。",
        //         "text": "意见如上所述。",
        //         "time": "2022/3/12 14:42",
        //         "name": "腿"
        //       },
        //       {
        //         "check_name": "右股骨正侧位片(DR)",
        //         "content": "急诊报告：\n右侧股骨远端、右胫骨中段及右腓骨中下段粉碎性骨折并右股骨及右胫骨内固定中，局部周围软组织肿胀并积气。",
        //         "text": "意见如上所述。",
        //         "time": "2022/3/12 14:42",
        //         "name": "腿"
        //       },
        //       {
        //         "check_name": "右膝关节正侧位片(DR)",
        //         "content": "急诊报告：\n右侧股骨远端、右胫骨中段及右腓骨中下段粉碎性骨折并右股骨及右胫骨内固定中，局部周围软组织肿胀并积气。",
        //         "text": "意见如上所述。",
        //         "time": "2022/3/12 14:42",
        //         "name": "腿"
        //       },
        //       {
        //         "check_name": "多层螺旋CT胸部(平扫)",
        //         "content": "急诊报告：\n对比2022-03-03片示：\n1.两肺多发斑片及条片影，较前减少，考虑肺挫伤或合并少许炎症，继续治疗后复查。\n2.双侧胸腔积液伴部分肺膨胀不全，较前减少。\n3.冠脉、主动脉钙化，纵隔及双肺门多发稍肿大淋巴结伴钙化。\n4.所示双侧多根肋骨骨折，部分稍错位；部分肋骨双边征改变。\n5.所示左侧肾上腺结节，腺瘤可能，必要时增强。",
        //         "text": "如上述，随诊。",
        //         "time": "2022/3/12 15:16",
        //         "name": "肺"
        //       },
        //       {
        //         "check_name": "多层螺旋CT肋骨成像(平扫+三维成像)",
        //         "content": "左侧枕叶可见斑片状低密度影；余脑实质内未见明显异常密度影，脑沟裂池增宽、加深，脑室系统扩大，中线结构居中。颅骨未见明显骨折征象。左侧额部及颜面部软组织稍肿胀，额部软组织内可见结节状致密影。\n    患者配合度欠佳，呼吸伪影较重，双侧多根肋骨呈双边影，右侧第1肋局部骨皮质毛糙，密度增高。右侧2-6肋骨骨折，断端移位。右侧第7肋、左侧第3肋局部骨皮质稍褶皱。左第4、5、6、10肋骨皮质不连续，部分断端稍移位。胸骨呈多边影。双侧胸腔内可见积液密度影，右肺上叶及双肺下叶部分膨胀不全。气管及上消化道内可见置管。\n    肝脏大小形态正常，肝右叶边缘可见结节状高密度影；余肝实质内未见异常密度影，肝内外胆管未见扩张；胆囊不大，囊腔内未见异常密度影。胰腺、脾脏及左肾未见异常。右肾内可见类圆形稍高密度影，大小约1.2×1.0cm。左侧肾上腺可见结节状稍低密度影，大小约1.1×1.6cm。膀胱充盈良好，壁未见增厚，腔内可见导尿管影及气体密度影；前列腺内可见结节状高密度影。精囊腺未见明显异常。腹盆腔内肠管显示未见异常征象，腹膜后未见肿大淋巴结，腹盆腔内未见积液。左侧髂外静脉内可见置管。",
        //         "text": "患者配合度欠佳，呼吸伪影较重，所示：\n双侧多根肋骨呈双边影，胸骨呈多边影，建议病情稳定后复查。\n右侧2-6肋、左第4、5、6、10肋骨骨折，部分断端移位。\n右侧第7肋、左侧第3肋局部骨皮质稍褶皱，建议随诊。\n右侧第1肋局部骨皮质毛糙，密度增高，偏陈旧性骨折可能，请结合临床病史。\n双侧胸腔积液；右肺上叶及双肺下叶部分膨胀不全，部分合并肺挫裂伤，随诊。\n左侧额部及颜面部软组织稍肿胀；左额部软组织结节状致密影，考虑异物，请结合临床。\n老年脑；左侧枕叶陈旧灶。\n左侧肾上腺结节，腺瘤可能，必要时增强。\n肝右叶钙化灶，右肾高密度囊肿；前列腺钙化。",
        //         "time": "2022/3/3 13:53",
        //         "name": "腿"
        //       },
        //       {
        //         "check_name": "多层螺旋CT扫描颅脑(平扫)",
        //         "content": "左侧枕叶可见斑片状低密度影；余脑实质内未见明显异常密度影，脑沟裂池增宽、加深，脑室系统扩大，中线结构居中。颅骨未见明显骨折征象。左侧额部及颜面部软组织稍肿胀，额部软组织内可见结节状致密影。\n    患者配合度欠佳，呼吸伪影较重，双侧多根肋骨呈双边影，右侧第1肋局部骨皮质毛糙，密度增高。右侧2-6肋骨骨折，断端移位。右侧第7肋、左侧第3肋局部骨皮质稍褶皱。左第4、5、6、10肋骨皮质不连续，部分断端稍移位。胸骨呈多边影。双侧胸腔内可见积液密度影，右肺上叶及双肺下叶部分膨胀不全。气管及上消化道内可见置管。\n    肝脏大小形态正常，肝右叶边缘可见结节状高密度影；余肝实质内未见异常密度影，肝内外胆管未见扩张；胆囊不大，囊腔内未见异常密度影。胰腺、脾脏及左肾未见异常。右肾内可见类圆形稍高密度影，大小约1.2×1.0cm。左侧肾上腺可见结节状稍低密度影，大小约1.1×1.6cm。膀胱充盈良好，壁未见增厚，腔内可见导尿管影及气体密度影；前列腺内可见结节状高密度影。精囊腺未见明显异常。腹盆腔内肠管显示未见异常征象，腹膜后未见肿大淋巴结，腹盆腔内未见积液。左侧髂外静脉内可见置管。",
        //         "text": "患者配合度欠佳，呼吸伪影较重，所示：\n双侧多根肋骨呈双边影，胸骨呈多边影，建议病情稳定后复查。\n右侧2-6肋、左第4、5、6、10肋骨骨折，部分断端移位。\n右侧第7肋、左侧第3肋局部骨皮质稍褶皱，建议随诊。\n右侧第1肋局部骨皮质毛糙，密度增高，偏陈旧性骨折可能，请结合临床病史。\n双侧胸腔积液；右肺上叶及双肺下叶部分膨胀不全，部分合并肺挫裂伤，随诊。\n左侧额部及颜面部软组织稍肿胀；左额部软组织结节状致密影，考虑异物，请结合临床。\n老年脑；左侧枕叶陈旧灶。\n左侧肾上腺结节，腺瘤可能，必要时增强。\n肝右叶钙化灶，右肾高密度囊肿；前列腺钙化。",
        //         "time": "2022/3/3 13:53",
        //         "name": "脑"
        //       },
        //       {
        //         "check_name": "床边摄片（单部位单次曝光+30）",
        //         "content": "两侧胸廓对称，气管居中，左肺野被左前肢遮挡，显示不清。余两肺野未见明显肺实变活动性病灶。肺门大小，位置及密度正常。胸膜无增厚及粘连。心脏形态、大小在正常范围内。双侧膈肌光滑，肋膈角锐利。",
        //         "text": "左肺野被左前肢遮挡，余双肺野未见明显异常，随诊。",
        //         "time": "2022/2/24 11:32",
        //         "name": "血管"
        //       }
        //     ]
        //   },
        //   {
        //     "id": "1001Z810000002TZWXG8",
        //     "sub_content": [
        //       {
        //         "check_name": "彩色多普勒心脏+组织多普勒显像+室壁运动分析",
        //         "content": "测值：\n右室内径:17mm(20-25)   右室流出道:31mm(19-35) 左房前后径:30mm(19-35)\n主动脉根部:18mm(20-37) 升主动脉径:24mm (&lt38)  室间隔厚度:10mm(6-11) \n左室后壁厚度:10mm(6-11)左室舒张末径:43mm(35-56) 左室射血分数:61%    \n肺动脉径:22mm(16-24)\n多普勒超声：   \nMV：E峰:77cm/s，A峰:120cm/s ；TV:cm/s； AV:161cm/s；PV:128cm/s；\n超声所见：\n　　各房室腔内径正常范围，室间隔及左、右室壁厚度正常，运动协调，收缩幅度正常。各瓣膜形态、结构、运动未见明显异常。大动脉关系、内径正常。心包腔未见异常。\n多普勒检查：\n三尖瓣口探及少量反流，速度约 2.3m/s；PG约 20mmHg； \n主动脉瓣口探及少-中量反流，速度约 3.5m/s； \n组织多普勒（TDI）：心尖四腔切面\n二尖瓣环舒张期运动速度：间隔侧 E’:5cm/s；A’:10 cm/s\n                        侧壁侧 E’:9cm/s；A’:12 cm/s\n室壁运动分析：左室壁各节段运动未见明显异常",
        //         "text": "1.三反（少量）；主反（少中量）\n2.静息状态下室壁运动未见明显异常",
        //         "time": "2022/3/31 9:54",
        //         "name": "心"
        //       },
        //       {
        //         "check_name": "彩色图片打印",
        //         "content": "检查所见:双侧鼻腔黏膜稍充血、光滑，左中鼻道成术后改变，各窦口开放可，粘膜光滑，右侧下鼻甲与鼻中隔稍粘连，见清亮分泌物，鼻咽部黏膜光滑。",
        //         "text": "检查提示:鼻炎\n左鼻内镜术后",
        //         "time": "2022/3/31 9:50",
        //         "name": "血管"
        //       },
        //       {
        //         "check_name": "局部麻醉",
        //         "content": "检查所见:双侧鼻腔黏膜稍充血、光滑，左中鼻道成术后改变，各窦口开放可，粘膜光滑，右侧下鼻甲与鼻中隔稍粘连，见清亮分泌物，鼻咽部黏膜光滑。",
        //         "text": "检查提示:鼻炎\n左鼻内镜术后",
        //         "time": "2022/3/31 9:50",
        //         "name": "血管"
        //       },
        //       {
        //         "check_name": "硬性鼻咽镜检查",
        //         "content": "检查所见:双侧鼻腔黏膜稍充血、光滑，左中鼻道成术后改变，各窦口开放可，粘膜光滑，右侧下鼻甲与鼻中隔稍粘连，见清亮分泌物，鼻咽部黏膜光滑。",
        //         "text": "检查提示:鼻炎\n左鼻内镜术后",
        //         "time": "2022/3/31 9:50",
        //         "name": "鼻"
        //       },
        //       {
        //         "check_name": "鼻内镜检查",
        //         "content": "检查所见:双侧鼻腔黏膜稍充血、光滑，左中鼻道成术后改变，各窦口开放可，粘膜光滑，右侧下鼻甲与鼻中隔稍粘连，见清亮分泌物，鼻咽部黏膜光滑。",
        //         "text": "检查提示:鼻炎\n左鼻内镜术后",
        //         "time": "2022/3/31 9:50",
        //         "name": "鼻"
        //       },
        //       {
        //         "check_name": "彩超浅表淋巴结8部位(颈/耳/颌/锁骨/腋/腹股沟/腘/滑)",
        //         "content": "双侧耳前、耳后、颌下、颏下、颈部、锁骨上窝、腋窝、滑车上、腹股沟、腘窝未见明显异常淋巴结回声。",
        //         "text": "双侧耳前、耳后、颌下、颏下、颈部、锁骨上窝、腋窝、滑车上、腹股沟、腘窝未见明显异常淋巴结回声",
        //         "time": "2022/3/31 9:45",
        //         "name": "脑"
        //       },
        //       {
        //         "check_name": "彩超甲状腺",
        //         "content": "甲状腺大小：\n左侧叶：5.0*1.4*1.1cm； \n右侧叶：4.9*1.9*1.1cm；\n峡部：厚0.2cm。\n左侧叶甲状腺内可见多个囊实性结节，较大者位于上极，大小约0.7*0.6*0.5cm，边界清晰，形态规则，内未见明显强回声，纵横比&lt1。CDFI：其内可见少许血流信号。\n右侧叶甲状腺内可见多个囊实性结节，较大者位于中极，大小约 1.4*1.0*0.9cm，边界清晰，形态规则，内未见明显强回声，纵横比&lt1。CDFI：其内可见血流信号。",
        //         "text": "双侧叶甲状腺结节，C-TIRADS 3类，建议结合临床",
        //         "time": "2022/3/31 9:45",
        //         "name": "血管"
        //       }
        //     ]
        //   },]
        return data.filter(item => item.id[0] === personId);
      } catch (error) {
        console.error('Error fetching data:', error);
        return null;
      }
    }

    return {
      id,
      healthProfile,
      loadHealthProfile,
    };
  },
};
</script>

<style>
.health-profile-card {
  margin-top: 20px;
}

.record-item {
  margin-bottom: 10px;
  padding: 10px;
  border: 1px solid #ddd;
  border-radius: 4px;
  background-color: #f9f9f9;
}

.record-item h3 {
  margin: 0;
  font-size: 1em;
}

.record-item p {
  margin: 0;
  font-size: 0.9em;
  color: #333;
}
</style>
